/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   Karen.cpp                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ecamara <ecamara@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/04/03 10:27:36 by ecamara           #+#    #+#             */
/*   Updated: 2022/09/13 10:49:37 by ecamara          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "Karen.hpp"

Karen::Karen(void)
{
	funct[0] = &Karen::_debug;
	funct[1] = &Karen::_info;
	funct[2] = &Karen::_warning;
	funct[3] = &Karen::_error;
	messages[0] = std::string("DEBUG");
	messages[1] = std::string("INFO");
	messages[2] = std::string("WARNING");
	messages[3] = std::string("ERROR");
	return ;
}

Karen::~Karen(void)
{
	return ;
}

void	Karen::complain(std::string level)
{
	int	i;
	int	check;
	int access;

	i = 0;
	check = 0;
	access = 0;
	while (i < 4)
	{
		if (messages[i] == level || check)
		{
			(this->*funct[i])();
			check = 1;
		}
		i++;
	}
	if (!check)
		std::cout << "Probably complaining about insignificant problem" << std::endl;
}

void Karen::_debug( void )
{
	std::cout << "I want to speak to your manager" << std::endl;
	return ;
}

void Karen::_info( void )
{
	std::cout << "Do you know who I am?" << std::endl;
	return ;
}

void Karen::_warning( void )
{
	std::cout << "You can't record me without MY PERMISSION!!!" << std::endl;
	return ;
}

void Karen::_error( void )
{
	std::cout << "@̷̨̱̪̪͇̱͕̰̣̹͕͔̘̞̝͈͈̀͌̅́̂̏̈́́̽̎̈́̊̌̽̐̄̎̌̆̊̀͐̆͗̑̄͋̋̎̅͋̈̚̚̕̕͝͝͠͝͠$̸̨̧̛̫̰̬͗̌͂͌͜#̸̡̡̡̠̳̪͙̟̦̮͇̝̫͓̳̣̬̤̫̱͉͇̦̣̮̜̮̻̟̤͓̻̻̙̮̝͐̂̓̽̂̈̍̇̍̈́̀̾̓͒̓͗͒͐̈́̿̓̿̎̇̐̋͐̈̚͜^̸̨̢̛̘̗̺̲̲̺̞͓̠͇̹͓̺̏͂̽̅̽͛̎͒̉͆͑͐̓̂̂̂͑̆͊̅̎̈̑͂̑͋̈́̽̓͋̍̀͐̔͐̆̓̍̚͜͝͠͝͝͠F̴̨̡̧̡̡͖͉̘̮̤̻͍̲͔͙̮͓͙͙̱̳̤̬̥͕͍̞̲̤̉͑͊́͐́͊͑͌͛̊̓̐͒̊̍̽͆͂̑̔̆͛̎̾́̿́̆̾̓̅͘̚͠P̴̻̫̩̤̾̑̌̆̂̉͂͛̒̀̈́̓̾̓͊̽̀̔͛̏̄̓͛̎͆̎̿̒̈̈́͊̉̚͝D̷̢̛͖͓̤̭͓̭̪̦̩̩͆̓̓͑̄́̉͑̌͒̎̽̍̚ͅS̷̡̡͈̭̫̩̩̙̙̫̮̥͚̼̾̂̃̿̈́̍̈́́͑͋̎̉̈́͌͐͌̄̐̋̓̑̍͛̓̍̑͂͆̍͊̀̉̏͘̚͝͝͝W̴̛̛͖̫̗͓͓̥̞͉̠̪̅̈́͊̒̈́̓͒̆̌͗̓̾͌̍̂͂̐̒̇̈̐̊̈́̒̎͋̇͌̔̅̓̓̍̇͘̕̕̚̕͘͜͝͝ ̵̧̡̛̛̗̩̮̱͉͎͎̖̖͇̠̤̺͕̹̼̫̻͉̪͈͈͕̟͓͔̥̖͖̬̳͕̱͎̤̦̥̠̝̜͛͂̃̎͆̒͂̌̈́͒̆̃̐͂͗͌͐̂̉̇̋̃̀̎͗̈́͂̋̕͘͠ͅͅK̴̢̨̢̧̧̢̢̺̘̥̤̳̘͔̭͎̜̯̺͚͔͎̜̹͉̞̮̹̰̝͉͍̟̘̯͔̭̥̽̋̒̇̉̇́̂̀̅̾̃̃͗̓͒̀̓̈́̍̐̽͗̀̍͒̈̏͗̍̎̄́͛͆͛͐̊̈́̚̚͝͝F̷̡̡̛̛͎̜̥͖̳̬̲̹̙̦͇̻̠̼̫̠̭̳̠͉̥̅̇̄̅͛͛̓̽͗̐̃͗́͋̏͆͛̾͛̏̽͑̀̏̿̐̄̆̋̒̚̚͘͝ͅͅ#̷̨̧̢̡̛̛̺̹̼̪̙̥̹̝͖͉̻̗͕͚̝͙͓͉̙͔̼̺͉̣͖̭͍͓̩̼̻̹̖̪̞̰̘̼̖͙̗̯́̂̐͆́́̊́͌̐͌͐́͆̀͋̽̑̄͋͑́̒̆̋͂̽̀̊̔̌̆̓̐̐̀͒̇̚̕͜͜͝͝͝͝͠K̵̹̫̖͔͐͌͑̈̌͗̅́͘L̸̨̡̡̡̧̧̛̘̻̯̳̮̮̜̠̪͚̟̹̫̤̬̘̻̙͎̘̹̩͍̥̤̞͕͉̹̬̹̪͖̯͇̪̪̻͉͒̽̏͌̀̏̃̊́̇͂̏̌͌͛̆̚͜͜͜͠ͅͅ%̷̢̡̛͚̖̱̤̺̖̦̰͓̠͕̤̼̦̭͍͇̗̜̥̼͍̙̦̟͉̻̩͉͙̲̱̞͕̣̠͓̥͔̦̤̏͐̈́͂͐̄̆͋̈́̂͐́̎̏͗́̃̆̂̿̓̈̀͆͌̑̿͌͆̋͘͘͘̚͜͝͠ͅ ̷̬͎͗̄̾̌̐̈́̉͐͆̓̊̆̈́̓̃̈̌̀̎͝͝͠B̸̨̟̫̺̬̲̥͍̙̓̑̑͊̑̓̍̍̉͐̔̂̑͐͗̅̌̉̒̿̀̿͌͛͐̒̅̀̕͠͝͝͠͝ͅQ̵̨̹̘̤̺̰̺͉̪̬̲̣̖̦͇̂̌̉͌̈́̃̑̍̄͌̈́̒̅̒͗͘͜͝ͅ ̴̨̨̛̛̛̛̻̥̪͈̥̮̮̝̼̦̩͍̣̤͖̗͍͙̯̯͈̪͖̳̹̲̮̩͈̩̗͖͖̻͚͕͍̞͓̄͑̇̋͛̅́͊̔̅̒͌͛̊͋̈͛̇̇͑̔̎̌̿͊̍̉̋̽̒̓́̃̄̌̚̚͘̕͝͝͝͝ͅW̵͎̬̝̣̰͎̱̓̀̈̐̎͌̀͘$̸̡̙̲̝̳̯̜͔̙̟̝̟͕̪͈͐ͅ^̷͔͕̤̖̗͕̱̱̣̈́̈́̋̓̑̆͗̓̉͒̑̎͊̆̋̿̽͛̔͒̈́̐͗̑̿̓̃̑̍̑͆͘̕͜͠͝L̵̻͚͈͛̀̆̽͒̏̏̓͛̄͆̋͌̓͐̌͒̀̈̿̓̔̎̽̃̄̃͊͊̏́̇͆̔̅̌͊̿̓̃̍͌̅̽̚͘̚̚͝͠%̴̡̨̦̟͔̘̙͕̥̙̟̭̪͕͙̞̜̜͖̪̲͈͍̘̰̏̅̐͗͒͛͊͋̔̏̀̈̎̿́̊̈̆̅͌̈̉̌̕͘̚̕͜͠͠͝ͅͅ&̸̢̛̛̥͖̩̙̞̺̟̤̫͓͓͈̲̼̱̝̦̾̅̿̾̓̀̐͆̅̑̉͊͋̈́̈́́̔̑̇̈́̀͒͑̽̋̄̾̀̈́̊̄̉̊̊͗͆̅̓̽̐͘͘̕͘͝͠U̶̢̢̧̧̡̢͕͚͓͎̤͖͎̻̮͔̼͍͉̳̫̱͇̪͂͜Ķ̵̛̫͖͎͉̙̩͍̘̠̰̖̩̘͈͓͈̲͙͉͖̺̪͖̯̼̻̺̀̀͌̀̓̌̋̈́̍̇͒̐̓̊̿́͋̂͋͋̆̌̅͆̔̑̔́̕̕̕̕͜͠͝͠͠ͅ^̷̱̼͓͚̰̘͕̇̄̄͛̾̃͂̈́̕ͅ$̵̧̞̘̹͚͍̌̑̉̆̑̔̈́̄͒̔͊̈́͝ ̶̨̡̢̢̡̢͎͚̣̝̘̹̟̣̩̬͕̹̯̠̳̩͔̩̺̥̪̟̝̜͙̲̺̪̤̺͕͉͚͇͇͚̉͛̽͑̋͜͜ͅŜ̴̡̲̞͖̻̗̰̲̦̦̿̀̎̿͋͝E̵̟̼̙̳̖͎̅̍̐̆͐̏͛̀̄̿̓̈̿͝G̵̙̥̎̓͋͛̿̈́̓̽̈́̏̀̄͑̉̈́͛̏̅̋̽͊̊̃͊̂͆̋̕̕͘͠͠͝͝M̷̡͍̹̪̙̮̹̪͇̽̈́͂̓͐͑̈̆̎̽̍̈́̎̚͝Ȩ̴̡̧̢̛̛̠̱͇̣̳͓̰̹͍̬̦̻͈̮̜̖͓̪̝͙̮͍̭̣̖̠̙͈̯̮̩͓̳̮͍̼͙̻̭͙̭̉͑̇̏̉̂̍̅̐̀̀̌̃͗̌̈͆̌̋͐͂̀̉̂͑͊̄͂͌͑͌͛͑̕̚͜͝͝Ň̵̡̧̝̟̬̦̳̫̘̰͎̞̝̬̜̥̩̥̤̩͕̘̩̙͍̠̭̯̳̤̲̏͛͆̀͜Ṯ̷̨̢̢̮̲̺͔̟̘̺̳̝̯͉̖̩̘͖̳̻̫̹͔͈̺͕͈̼̳̙͓̾́͑͛͋̉́̓̄̍͛͌̽͛̑͑͜͜Ă̷̛̗͇̟̞̻͚̮͉̘̪̠̻͙͔̲̦̣͚̙͕̹̼̲̬͇͇̣͙̜̬̎̉̒̐͐̏̆̋̇̀̔̀̈́̊̔͝T̷̛̥̣̰͇̙̦̻̳͎͈̘̼̪̱͙̲̬̦̈̐͗͛̌͆́̉͌̊̌̒̏̔͆̃̽̃̂̀͊̆̾͒̐͌̎̐̀̊̃͛́̃̿̃̀̈́͘̕̕͝͝͠͝͠͠I̶̧̢̨̧̛̫͓̩̙͈̰͓̯̻̳̤͇̱̠̪̲̭̱̤̥̫̫͍͍̭͔̾̋͊̒̓͂̈́̄̿͌̋̐͐̓̽̿̑͐̊̾̂͗̊̅̈́̚͠͝O̷̧̡̹̰̖̪̠͙̯͎̪̭̣̞̼̰͎͙̼̤̰̘͕̰͎͕̬͌̃̇̅̾̍̔̅̓̂̅͋͑͗̀̈̓͆̈́̎͂͒̿̚̚̕͘͜͜͝ͅN̶̢̡̖̭̯̘̘̮͗͌̌̽̎ͅ ̶̧̨̛̰̲̳̭̹͚̗̱͍̣̭̼̘̜̭̻̩̤͙͑͋̃̂̌̋̾̽͘͝F̸̢̨̛̼̮͎̳̘̠̲̤͓̻̳̯̼̟͉̞͍̱̹̪̲̲͙͉̰͙̩̞̳̲͈̦͕͔̺͕̺̀̍̔̃̈́̃̑̀̽̈̒̅͊̊͋̈́̉̆͒̀͌͊̆̈̇̈̆̾̅͗͐͌A̷̡̝̯͖͎̗̹̪̪͉̘̱̮͍̥͙̮̤͈̪͊̆̈̾̏͛͐̀̑͐̾͊̈̂͂̾̈́̀͗̑̀̒̐̾̂̅̈́̕͘͘͜͠Ủ̷̥̠͎̙̆̾̒̉͂̌̎̔̀͒̔͑̔͋̌̂̈́͗̏̆͑̆̚͜͠L̵̡̢̢̨͓̤̭̙̰̺͕͉͍̳̪̼̙͎̩̣̟̠̹̼̦̜̟̯̜̙̯̙̜̤̜͖̜̦͙͎̭͙͙̥͔̳̽͒͆̏̋̐͑̊̉̐́̿̀̊̄͊̒̽̍̏̍́̋͛̿̓̿̕̚͝͠͠ͅͅT̸̙̱̃̂͆̈́́̈́̍̈́̄̌̓̌̋̉̇̾̽͂͊͛̑͊̌̐̕̚͝͠" << std::endl << std::endl << std::endl;
	return ;
}